2021/joints2021/Quals/Web/Solo/solo_server/myapp/app/controllers/pages_controller.rb

	def show
		if Page.exists? params[:page_id]
			@page = Page.find(params[:page_id])
---
SELECT 1 AS one FROM "pages" WHERE (select hex('J')=(SELECT hex(substr(content,1,1)) FROM ckuaks_flag)) LIMIT ?  [["LIMIT", 1]]
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
	 	@page = Page.new(page_params)

	 	if @page.save
---
INSERT INTO "pages" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asd"], ["text", "asdsad"], ["created_at", "2020-09-24 14:16:56.924367"], ["updated_at", "2020-09-24 14:16:56.924367"]]