2021/joints2021/Quals/Web/Solo/solo_server/myapp/app/controllers/sessions_controller.rb

  def create
    # Look up User in db by the email address submitted to the login form and
    # convert to lowercase to match email in db in case they had caps lock on:
    user = User.find_by(email: params[:login][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@admin.com"], ["LIMIT", 1]]